task/single-software-execution/cli/openfoam/task-07/init_file/cylinder_base/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5; // TODO_END_TIME

deltaT          0.001; // TODO_DELTA_T

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //

functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");
        patches         (cylinder); // TODO_FORCE_PATCH
        rho             rhoInf;
        rhoInf          1000; // TODO_RHO_INF
        CofR            (0 0 0); // TODO_CYLINDER_CENTER
    }
}
